GopalSaraf/Practicals/PSDL/include/proc/pic18f44j11.inc
// Register: PORTB
#define PORTB PORTB
PORTB                                    equ 0F81h
// bitfield definitions
PORTB_RB0_POSN                           equ 0000h
PORTB_RB0_POSITION                       equ 0000h
PORTB_RB0_SIZE                           equ 0001h
PORTB_RB0_LENGTH                         equ 0001h
PORTB_RB0_MASK                           equ 0001h
PORTB_RB1_POSN                           equ 0001h
PORTB_RB1_POSITION                       equ 0001h
PORTB_RB1_SIZE                           equ 0001h
PORTB_RB1_LENGTH                         equ 0001h
PORTB_RB1_MASK                           equ 0002h
PORTB_RB2_POSN                           equ 0002h
PORTB_RB2_POSITION                       equ 0002h
PORTB_RB2_SIZE                           equ 0001h
PORTB_RB2_LENGTH                         equ 0001h
PORTB_RB2_MASK                           equ 0004h
PORTB_RB3_POSN                           equ 0003h
PORTB_RB3_POSITION                       equ 0003h
PORTB_RB3_SIZE                           equ 0001h
PORTB_RB3_LENGTH                         equ 0001h
PORTB_RB3_MASK                           equ 0008h
PORTB_RB4_POSN                           equ 0004h
PORTB_RB4_POSITION                       equ 0004h
PORTB_RB4_SIZE                           equ 0001h
PORTB_RB4_LENGTH                         equ 0001h
PORTB_RB4_MASK                           equ 0010h
PORTB_RB5_POSN                           equ 0005h
PORTB_RB5_POSITION                       equ 0005h
PORTB_RB5_SIZE                           equ 0001h
PORTB_RB5_LENGTH                         equ 0001h
PORTB_RB5_MASK                           equ 0020h
PORTB_RB6_POSN                           equ 0006h
PORTB_RB6_POSITION                       equ 0006h
PORTB_RB6_SIZE                           equ 0001h
PORTB_RB6_LENGTH                         equ 0001h
PORTB_RB6_MASK                           equ 0040h
PORTB_RB7_POSN                           equ 0007h
PORTB_RB7_POSITION                       equ 0007h
PORTB_RB7_SIZE                           equ 0001h
PORTB_RB7_LENGTH                         equ 0001h
PORTB_RB7_MASK                           equ 0080h
PORTB_AN12_POSN                          equ 0000h
PORTB_AN12_POSITION                      equ 0000h
PORTB_AN12_SIZE                          equ 0001h
PORTB_AN12_LENGTH                        equ 0001h
PORTB_AN12_MASK                          equ 0001h
PORTB_AN10_POSN                          equ 0001h
PORTB_AN10_POSITION                      equ 0001h
PORTB_AN10_SIZE                          equ 0001h
PORTB_AN10_LENGTH                        equ 0001h
PORTB_AN10_MASK                          equ 0002h
PORTB_AN8_POSN                           equ 0002h
PORTB_AN8_POSITION                       equ 0002h
PORTB_AN8_SIZE                           equ 0001h
PORTB_AN8_LENGTH                         equ 0001h
PORTB_AN8_MASK                           equ 0004h
PORTB_AN9_POSN                           equ 0003h
PORTB_AN9_POSITION                       equ 0003h
PORTB_AN9_SIZE                           equ 0001h
PORTB_AN9_LENGTH                         equ 0001h
PORTB_AN9_MASK                           equ 0008h
PORTB_PMA1_POSN                          equ 0004h
PORTB_PMA1_POSITION                      equ 0004h
PORTB_PMA1_SIZE                          equ 0001h
PORTB_PMA1_LENGTH                        equ 0001h
PORTB_PMA1_MASK                          equ 0010h
PORTB_PMA0_POSN                          equ 0005h
PORTB_PMA0_POSITION                      equ 0005h
PORTB_PMA0_SIZE                          equ 0001h
PORTB_PMA0_LENGTH                        equ 0001h
PORTB_PMA0_MASK                          equ 0020h
PORTB_KBI2_POSN                          equ 0006h
PORTB_KBI2_POSITION                      equ 0006h
PORTB_KBI2_SIZE                          equ 0001h
PORTB_KBI2_LENGTH                        equ 0001h
PORTB_KBI2_MASK                          equ 0040h
PORTB_KBI3_POSN                          equ 0007h
PORTB_KBI3_POSITION                      equ 0007h
PORTB_KBI3_SIZE                          equ 0001h
PORTB_KBI3_LENGTH                        equ 0001h
PORTB_KBI3_MASK                          equ 0080h
PORTB_INT0_POSN                          equ 0000h
PORTB_INT0_POSITION                      equ 0000h
PORTB_INT0_SIZE                          equ 0001h
PORTB_INT0_LENGTH                        equ 0001h
PORTB_INT0_MASK                          equ 0001h
PORTB_PMPBE_POSN                         equ 0001h
PORTB_PMPBE_POSITION                     equ 0001h
PORTB_PMPBE_SIZE                         equ 0001h
PORTB_PMPBE_LENGTH                       equ 0001h
PORTB_PMPBE_MASK                         equ 0002h
PORTB_CTEDG1_POSN                        equ 0002h
PORTB_CTEDG1_POSITION                    equ 0002h
PORTB_CTEDG1_SIZE                        equ 0001h
PORTB_CTEDG1_LENGTH                      equ 0001h
PORTB_CTEDG1_MASK                        equ 0004h
PORTB_CTEDG2_POSN                        equ 0003h
PORTB_CTEDG2_POSITION                    equ 0003h
PORTB_CTEDG2_SIZE                        equ 0001h
PORTB_CTEDG2_LENGTH                      equ 0001h
PORTB_CTEDG2_MASK                        equ 0008h
PORTB_KBI0_POSN                          equ 0004h
PORTB_KBI0_POSITION                      equ 0004h
PORTB_KBI0_SIZE                          equ 0001h
PORTB_KBI0_LENGTH                        equ 0001h
PORTB_KBI0_MASK                          equ 0010h
PORTB_KBI1_POSN                          equ 0005h
PORTB_KBI1_POSITION                      equ 0005h
PORTB_KBI1_SIZE                          equ 0001h
PORTB_KBI1_LENGTH                        equ 0001h
PORTB_KBI1_MASK                          equ 0020h
PORTB_PGC_POSN                           equ 0006h
PORTB_PGC_POSITION                       equ 0006h
PORTB_PGC_SIZE                           equ 0001h
PORTB_PGC_LENGTH                         equ 0001h
PORTB_PGC_MASK                           equ 0040h
PORTB_PGD_POSN                           equ 0007h
PORTB_PGD_POSITION                       equ 0007h
PORTB_PGD_SIZE                           equ 0001h
PORTB_PGD_LENGTH                         equ 0001h
PORTB_PGD_MASK                           equ 0080h
PORTB_RP3_POSN                           equ 0000h
PORTB_RP3_POSITION                       equ 0000h
PORTB_RP3_SIZE                           equ 0001h
PORTB_RP3_LENGTH                         equ 0001h
PORTB_RP3_MASK                           equ 0001h
PORTB_RTCC_POSN                          equ 0001h
PORTB_RTCC_POSITION                      equ 0001h
PORTB_RTCC_SIZE                          equ 0001h
PORTB_RTCC_LENGTH                        equ 0001h
PORTB_RTCC_MASK                          equ 0002h
PORTB_PMA3_POSN                          equ 0002h
PORTB_PMA3_POSITION                      equ 0002h
PORTB_PMA3_SIZE                          equ 0001h
PORTB_PMA3_LENGTH                        equ 0001h
PORTB_PMA3_MASK                          equ 0004h
PORTB_PMA2_POSN                          equ 0003h
PORTB_PMA2_POSITION                      equ 0003h
PORTB_PMA2_SIZE                          equ 0001h
PORTB_PMA2_LENGTH                        equ 0001h
PORTB_PMA2_MASK                          equ 0008h
PORTB_RP9_POSN                           equ 0006h
PORTB_RP9_POSITION                       equ 0006h
PORTB_RP9_SIZE                           equ 0001h
PORTB_RP9_LENGTH                         equ 0001h
PORTB_RP9_MASK                           equ 0040h
PORTB_RP10_POSN                          equ 0007h
PORTB_RP10_POSITION                      equ 0007h
PORTB_RP10_SIZE                          equ 0001h
PORTB_RP10_LENGTH                        equ 0001h
PORTB_RP10_MASK                          equ 0080h
PORTB_RP4_POSN                           equ 0001h
PORTB_RP4_POSITION                       equ 0001h
PORTB_RP4_SIZE                           equ 0001h
PORTB_RP4_LENGTH                         equ 0001h
PORTB_RP4_MASK                           equ 0002h
PORTB_REFO_POSN                          equ 0002h
PORTB_REFO_POSITION                      equ 0002h
PORTB_REFO_SIZE                          equ 0001h
PORTB_REFO_LENGTH                        equ 0001h
PORTB_REFO_MASK                          equ 0004h
PORTB_RP6_POSN                           equ 0003h
PORTB_RP6_POSITION                       equ 0003h
PORTB_RP6_SIZE                           equ 0001h
PORTB_RP6_LENGTH                         equ 0001h
PORTB_RP6_MASK                           equ 0008h
PORTB_RP7_POSN                           equ 0004h
PORTB_RP7_POSITION                       equ 0004h
PORTB_RP7_SIZE                           equ 0001h
PORTB_RP7_LENGTH                         equ 0001h
PORTB_RP7_MASK                           equ 0010h
PORTB_RP8_POSN                           equ 0005h
PORTB_RP8_POSITION                       equ 0005h
PORTB_RP8_SIZE                           equ 0001h
PORTB_RP8_LENGTH                         equ 0001h
PORTB_RP8_MASK                           equ 0020h
PORTB_RP5_POSN                           equ 0002h
PORTB_RP5_POSITION                       equ 0002h
PORTB_RP5_SIZE                           equ 0001h
PORTB_RP5_LENGTH                         equ 0001h
PORTB_RP5_MASK                           equ 0004h
PORTB_CCP2_PA2_POSN                      equ 0003h
PORTB_CCP2_PA2_POSITION                  equ 0003h
PORTB_CCP2_PA2_SIZE                      equ 0001h
PORTB_CCP2_PA2_LENGTH                    equ 0001h
PORTB_CCP2_PA2_MASK                      equ 0008h

// Register: PORTC
#define PORTC PORTC
PORTC                                    equ 0F82h
// bitfield definitions
PORTC_RC0_POSN                           equ 0000h
PORTC_RC0_POSITION                       equ 0000h
PORTC_RC0_SIZE                           equ 0001h
PORTC_RC0_LENGTH                         equ 0001h
PORTC_RC0_MASK                           equ 0001h
PORTC_RC1_POSN                           equ 0001h
PORTC_RC1_POSITION                       equ 0001h
PORTC_RC1_SIZE                           equ 0001h
PORTC_RC1_LENGTH                         equ 0001h
PORTC_RC1_MASK                           equ 0002h
PORTC_RC2_POSN                           equ 0002h
PORTC_RC2_POSITION                       equ 0002h
PORTC_RC2_SIZE                           equ 0001h
PORTC_RC2_LENGTH                         equ 0001h
PORTC_RC2_MASK                           equ 0004h
PORTC_RC3_POSN                           equ 0003h
PORTC_RC3_POSITION                       equ 0003h
PORTC_RC3_SIZE                           equ 0001h
PORTC_RC3_LENGTH                         equ 0001h
PORTC_RC3_MASK                           equ 0008h
PORTC_RC4_POSN                           equ 0004h
PORTC_RC4_POSITION                       equ 0004h
PORTC_RC4_SIZE                           equ 0001h
PORTC_RC4_LENGTH                         equ 0001h
PORTC_RC4_MASK                           equ 0010h
PORTC_RC5_POSN                           equ 0005h
PORTC_RC5_POSITION                       equ 0005h
PORTC_RC5_SIZE                           equ 0001h
PORTC_RC5_LENGTH                         equ 0001h
PORTC_RC5_MASK                           equ 0020h
PORTC_RC6_POSN                           equ 0006h
PORTC_RC6_POSITION                       equ 0006h
PORTC_RC6_SIZE                           equ 0001h
PORTC_RC6_LENGTH                         equ 0001h
PORTC_RC6_MASK                           equ 0040h
PORTC_RC7_POSN                           equ 0007h
PORTC_RC7_POSITION                       equ 0007h
PORTC_RC7_SIZE                           equ 0001h
PORTC_RC7_LENGTH                         equ 0001h
PORTC_RC7_MASK                           equ 0080h
PORTC_T1OSO_POSN                         equ 0000h
PORTC_T1OSO_POSITION                     equ 0000h
PORTC_T1OSO_SIZE                         equ 0001h
PORTC_T1OSO_LENGTH                       equ 0001h
PORTC_T1OSO_MASK                         equ 0001h
PORTC_T1OSI_POSN                         equ 0001h
PORTC_T1OSI_POSITION                     equ 0001h
PORTC_T1OSI_SIZE                         equ 0001h
PORTC_T1OSI_LENGTH                       equ 0001h
PORTC_T1OSI_MASK                         equ 0002h
PORTC_AN11_POSN                          equ 0002h
PORTC_AN11_POSITION                      equ 0002h
PORTC_AN11_SIZE                          equ 0001h
PORTC_AN11_LENGTH                        equ 0001h
PORTC_AN11_MASK                          equ 0004h
PORTC_SCK1_POSN                          equ 0003h
PORTC_SCK1_POSITION                      equ 0003h
PORTC_SCK1_SIZE                          equ 0001h
PORTC_SCK1_LENGTH                        equ 0001h
PORTC_SCK1_MASK                          equ 0008h
PORTC_PMA5_POSN                          equ 0006h
PORTC_PMA5_POSITION                      equ 0006h
PORTC_PMA5_SIZE                          equ 0001h
PORTC_PMA5_LENGTH                        equ 0001h
PORTC_PMA5_MASK                          equ 0040h
PORTC_PMA4_POSN                          equ 0007h
PORTC_PMA4_POSITION                      equ 0007h
PORTC_PMA4_SIZE                          equ 0001h
PORTC_PMA4_LENGTH                        equ 0001h
PORTC_PMA4_MASK                          equ 0080h
PORTC_T1CKI_POSN                         equ 0000h
PORTC_T1CKI_POSITION                     equ 0000h
PORTC_T1CKI_SIZE                         equ 0001h
PORTC_T1CKI_LENGTH                       equ 0001h
PORTC_T1CKI_MASK                         equ 0001h
PORTC_CTPLS_POSN                         equ 0002h
PORTC_CTPLS_POSITION                     equ 0002h
PORTC_CTPLS_SIZE                         equ 0001h
PORTC_CTPLS_LENGTH                       equ 0001h
PORTC_CTPLS_MASK                         equ 0004h
PORTC_SCL1_POSN                          equ 0003h
PORTC_SCL1_POSITION                      equ 0003h
PORTC_SCL1_SIZE                          equ 0001h
PORTC_SCL1_LENGTH                        equ 0001h
PORTC_SCL1_MASK                          equ 0008h
PORTC_SDI1_POSN                          equ 0004h
PORTC_SDI1_POSITION                      equ 0004h
PORTC_SDI1_SIZE                          equ 0001h
PORTC_SDI1_LENGTH                        equ 0001h
PORTC_SDI1_MASK                          equ 0010h
PORTC_SDO1_POSN                          equ 0005h
PORTC_SDO1_POSITION                      equ 0005h
PORTC_SDO1_SIZE                          equ 0001h
PORTC_SDO1_LENGTH                        equ 0001h
PORTC_SDO1_MASK                          equ 0020h
PORTC_TX1_POSN                           equ 0006h
PORTC_TX1_POSITION                       equ 0006h
PORTC_TX1_SIZE                           equ 0001h
PORTC_TX1_LENGTH                         equ 0001h
PORTC_TX1_MASK                           equ 0040h
PORTC_RX1_POSN                           equ 0007h
PORTC_RX1_POSITION                       equ 0007h
PORTC_RX1_SIZE                           equ 0001h
PORTC_RX1_LENGTH                         equ 0001h
PORTC_RX1_MASK                           equ 0080h
PORTC_RP11_POSN                          equ 0000h
PORTC_RP11_POSITION                      equ 0000h
PORTC_RP11_SIZE                          equ 0001h
PORTC_RP11_LENGTH                        equ 0001h
PORTC_RP11_MASK                          equ 0001h
PORTC_RP12_POSN                          equ 0001h
PORTC_RP12_POSITION                      equ 0001h
PORTC_RP12_SIZE                          equ 0001h
PORTC_RP12_LENGTH                        equ 0001h
PORTC_RP12_MASK                          equ 0002h
PORTC_RP13_POSN                          equ 0002h
PORTC_RP13_POSITION                      equ 0002h
PORTC_RP13_SIZE                          equ 0001h
PORTC_RP13_LENGTH                        equ 0001h
PORTC_RP13_MASK                          equ 0004h
PORTC_RP14_POSN                          equ 0003h
PORTC_RP14_POSITION                      equ 0003h
PORTC_RP14_SIZE                          equ 0001h
PORTC_RP14_LENGTH                        equ 0001h
PORTC_RP14_MASK                          equ 0008h
PORTC_RP15_POSN                          equ 0004h
PORTC_RP15_POSITION                      equ 0004h
PORTC_RP15_SIZE                          equ 0001h
PORTC_RP15_LENGTH                        equ 0001h
PORTC_RP15_MASK                          equ 0010h
PORTC_RP16_POSN                          equ 0005h
PORTC_RP16_POSITION                      equ 0005h
PORTC_RP16_SIZE                          equ 0001h
PORTC_RP16_LENGTH                        equ 0001h
PORTC_RP16_MASK                          equ 0020h
PORTC_CK1_POSN                           equ 0006h
PORTC_CK1_POSITION                       equ 0006h
PORTC_CK1_SIZE                           equ 0001h
PORTC_CK1_LENGTH                         equ 0001h
PORTC_CK1_MASK                           equ 0040h
PORTC_DT1_POSN                           equ 0007h
PORTC_DT1_POSITION                       equ 0007h
PORTC_DT1_SIZE                           equ 0001h
PORTC_DT1_LENGTH                         equ 0001h
PORTC_DT1_MASK                           equ 0080h
PORTC_RP17_POSN                          equ 0006h
PORTC_RP17_POSITION                      equ 0006h
PORTC_RP17_SIZE                          equ 0001h
PORTC_RP17_LENGTH                        equ 0001h
PORTC_RP17_MASK                          equ 0040h
PORTC_RP18_POSN                          equ 0007h
PORTC_RP18_POSITION                      equ 0007h
PORTC_RP18_SIZE                          equ 0001h
PORTC_RP18_LENGTH                        equ 0001h
PORTC_RP18_MASK                          equ 0080h
PORTC_CCP2_POSN                          equ 0001h
PORTC_CCP2_POSITION                      equ 0001h
PORTC_CCP2_SIZE                          equ 0001h
PORTC_CCP2_LENGTH                        equ 0001h
PORTC_CCP2_MASK                          equ 0002h
PORTC_PA1_POSN                           equ 0002h
PORTC_PA1_POSITION                       equ 0002h
PORTC_PA1_SIZE                           equ 0001h
PORTC_PA1_LENGTH                         equ 0001h
PORTC_PA1_MASK                           equ 0004h
PORTC_PA2_POSN                           equ 0001h
PORTC_PA2_POSITION                       equ 0001h
PORTC_PA2_SIZE                           equ 0001h
PORTC_PA2_LENGTH                         equ 0001h
PORTC_PA2_MASK                           equ 0002h

